_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_2 (Lambda)            (None, 160, 320, 3)       0         
_________________________________________________________________
cropping2d_2 (Cropping2D)    (None, 80, 320, 3)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 38, 158, 24)       1824      
_________________________________________________________________
activation_8 (Activation)    (None, 38, 158, 24)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 17, 77, 36)        21636     
_________________________________________________________________
activation_9 (Activation)    (None, 17, 77, 36)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 7, 37, 48)         43248     
_________________________________________________________________
activation_10 (Activation)   (None, 7, 37, 48)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 5, 35, 64)         27712     
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 3, 33, 64)         36928     
_________________________________________________________________
flatten_2 (Flatten)          (None, 6336)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 1164)              7376268   
_________________________________________________________________
activation_11 (Activation)   (None, 1164)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 100)               116500    
_________________________________________________________________
activation_12 (Activation)   (None, 100)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 50)                5050      
_________________________________________________________________
activation_13 (Activation)   (None, 50)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 10)                510       
_________________________________________________________________
activation_14 (Activation)   (None, 10)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 11        
=================================================================
Total params: 7,629,687
Trainable params: 7,629,687
Non-trainable params: 0
_________________________________________________________________
